clear all;
close all;

%% WHP-SQP
X = sym('x',[1,2]).';
f = X(1)^3+X(2)^2;
c = [X(2)-X(1)^2-1];
X_list = ch19_WHP_SQP(f, c, [0.2;0.2], 1e-6);        % 满足/不满足约束的初始解 [1;2]/[0.2;0.2] 
% 迭代次数分别为 26/25
x_star = X_list(:,end)                               % 均收敛到真解为[0 1];

%% AL-SQP
X = sym('x',[1,2]).';
f = X(1)^3+X(2)^2;
c = [X(2)-X(1)^2-1];
X_list = ch19_AL_SQP(f, c, [1;2], 1e-6);             % 满足/不满足约束的初始解 [1;2]/[0.2;0.2]
x_star = X_list(:,end)                               % 均收敛到真解为[0 1];
                                                     % 迭代次数分别为 129/42

% Page203 Example
X = sym('x',[1,2]).';
f = 1/2*(X(1)^2+2*X(2)^2);
c = [X(1)+X(2)-1];
X_list = ch19_AL_SQP(f, c, [1;2], 1e-6);             % 满足/不满足约束的初始解 [1;2]/[0.2;0.2]
x_star = X_list(:,end)  


% X_list = ch18_AL_SUMT(f, c, [1;2], 1e-6);          % 初始解不满足约束满足/不满足约束的初始解 [1;2]/[0.2;0.2]
% x_star = X_list(:,end)                             % 收敛到真解为[0 1];
                                                     % 迭代次数分别为 3/4
