clear all;

%% B-SUMT
% example in Page243
X = sym('x',[1,2]).';
f = X(1)^2+3*X(2)^2;
c = [X(1)+5*X(2)-1];
X_list = ch22_B_SUMT(f, c, [0.2;0.2], 1e-6);         % 非有效满足约束的初始解 [1;2]/[0.2;0.2] 
% 迭代次数分别为 40/36
x_star = X_list(:,end)                               % 均收敛到真解为[0.1071 0.1786];
% 对于严格满足约束的初始解与不满足约束的初始解，均不会收敛

% exercise in page 244
X = sym('x',[1,2]).';
f = X(1)+X(2);
c = [-X(1)^2-X(2)^2+2];   % x1^2+x2^2<=2
X_list = ch22_B_SUMT(f, c, [0.2;0.2], 1e-6);    % 非有效满足约束的初始解 [0.2;0.2]
% 迭代次数为 34 / 初始解不能取[1;1]
x_star = X_list(:,end)                          % 收敛到真解为[-1;-1];

% 初始可行解如果难找，需要求解以下优化问题
% min f(x) = sum(min([zeros(size(c));c],[],2).^2)

%% B-SUMT compare with IPM
% example in Page252
X = sym('x',[1,2]).';
f = X(1)^2+3*X(2)^2;
c = [X(1)+5*X(2)-1; 5*X(1)-X(2)-0.25];
X_list = ch22_B_SUMT(f, c, [0.25;0.2], 1e-6);       % 非有效满足约束的初始解[0.25;0.2], 迭代次数为35
x_star = X_list(:,end)                              % 收敛到真解为[0.1071;0.1786];
